---
kind: method
id: M:Autodesk.Revit.DB.Panel.GetRefGridLines(Autodesk.Revit.DB.ElementId@,Autodesk.Revit.DB.ElementId@)
zh: 面板
source: html/3f676294-eaab-5027-c94c-25970e5ebb76.htm
---
# Autodesk.Revit.DB.Panel.GetRefGridLines Method

**中文**: 面板

This method is used to get the reference gridlines.

## Syntax (C#)
```csharp
public void GetRefGridLines(
	ref ElementId uGridLineId,
	ref ElementId vGridLineId
)
```

## Parameters
- **uGridLineId** (`Autodesk.Revit.DB.ElementId %`)
- **vGridLineId** (`Autodesk.Revit.DB.ElementId %`)